os2web_acadre_arp/test_data/request-18.soap.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <Publish xmlns="http://Acadre.Publishing.CMS.PublishingHandler.Demo">
      <info>
        <ItemId xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">06d6f520-2fe6-41a0-b72a-d16f415e9bc8</ItemId>
        <LocationId xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">default</LocationId>
        <Metadata xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">&lt;?xml version="1.0" encoding="utf-16"?&gt;
&lt;PublishedDocument xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.traen.com/2007/20/07/"&gt;
  &lt;AdministrativeUnit&gt;
    &lt;AdministrativeUnitGUID&gt;127f4700-88d7-48a0-b285-6d2271ec9694&lt;/AdministrativeUnitGUID&gt;
    &lt;AdministrativeUnitName&gt;Test enhed&lt;/AdministrativeUnitName&gt;
  &lt;/AdministrativeUnit&gt;
  &lt;Year&gt;2012&lt;/Year&gt;
  &lt;SequenceNumber&gt;69773&lt;/SequenceNumber&gt;
  &lt;Title&gt;Dokument 1&lt;/Title&gt;
  &lt;Description&gt;Test dokument&lt;/Description&gt;
  &lt;Category&gt;Afg.&lt;/Category&gt;
  &lt;Status&gt;R&lt;/Status&gt;
  &lt;DocumentType&gt;U&lt;/DocumentType&gt;
  &lt;CreationDate&gt;2012-07-31&lt;/CreationDate&gt;
  &lt;LastModificationDate&gt;2012-07-31&lt;/LastModificationDate&gt;
  &lt;AttachmentDate&gt;2012-07-31&lt;/AttachmentDate&gt;
  &lt;JournalizationDate&gt;2012-07-31&lt;/JournalizationDate&gt;
  &lt;DocumentLatestVersion&gt;
    &lt;VersionNumber&gt;1&lt;/VersionNumber&gt;
    &lt;FileReferenceId&gt;3345865&lt;/FileReferenceId&gt;
    &lt;FileReferenceVersionId&gt;1&lt;/FileReferenceVersionId&gt;
    &lt;Comment /&gt;
  &lt;/DocumentLatestVersion&gt;
  &lt;DocResponsibleUser&gt;
    &lt;UserInitials&gt;acadre&lt;/UserInitials&gt;
    &lt;UserName&gt;acadre&lt;/UserName&gt;
  &lt;/DocResponsibleUser&gt;
  &lt;IsPaperBased&gt;false&lt;/IsPaperBased&gt;
  &lt;ArrayOfSendersReceivers /&gt;
&lt;/PublishedDocument&gt;</Metadata>
        <PhysicalFileReference xmlns="http://schemas.datacontract.org/2004/07/Acadre.Publishing.CMS.PublishingHandler.Demo">
          <FileName>Dokument 1.DOCX</FileName>
          <ItemId>1635233</ItemId>
          <Version>1</Version>
        </PhysicalFileReference>
      </info>
      <parentItemId>f6db0d0e-cdef-4b9e-b68f-7c67136f916c</parentItemId>
    </Publish>
  </soap:Body>
</soap:Envelope>
